--【泰国】寻访配置
local searchCfg={
    --人物列表
      --build  所属建筑ID
      --type  类型  1：普通人  2：红颜
      --servantId  资源ID
      --base  资源奖励基础值
      --reward  寻访奖励  奖励的类型，系数通过运势取ratioList里的值  2：银两 3：粮草 4：士兵
      --ratioList  奖励的系数  注：系数有负数
      --wifeId  红颜ID
      --value  红颜获得进度
      --needTime  寻访时间要求  单位：秒
      --unlock  解锁条件  VIP等级，势力值，关注官微  【解锁寻访】
    personList={
        ["11"]={       ----草庐----冯唐
            ["build"]="1",
            ["type"]=1,
            ["base"]={0,0,0,0,0,1000,1000,1000,1000,1000},
            ["reward"]=3,
            ["ratioList"]={-0.03,-0.03,-0.03,-0.03,-0.03,0.1,0.1,0.1,0.1,0.1},
        },
        ["12"]={       ----草庐----冯小怜
            ["build"]="1",
            ["type"]=2,
            ["wifeId"]="101",
            ["value"]=0,
        },
        ["21"]={       ----客栈----金镶玉
            ["build"]="2",
            ["type"]=2,
            ["wifeId"]="208",
            ["value"]=0,
            ["unlock"]={["needPower"]=200000},
        },
        ["22"]={       ----客栈----伙计
            ["build"]="2",
            ["type"]=1,
            ["base"]={0,1000,0,1000,1000,3000,0,3000,1000,3000},
            ["reward"]=2,
            ["ratioList"]={0,0.1,0,0.1,0.1,0.2,0,0.2,0.1,0.5},
        },
        ["23"]={       ----客栈----郭瓖
            ["build"]="2",
            ["type"]=2,
            ["wifeId"]="206",
            ["value"]=20,
            ["needTime"]=86400,
        },
        ["31"]={       ----烟雨楼----花姐
            ["build"]="3",
            ["type"]=2,
            ["wifeId"]="102",
            ["value"]=4,
        },
        ["32"]={       ----烟雨楼----二狗子
            ["build"]="3",
            ["type"]=1,
            ["base"]={0,0,0,0,0,1000,1000,1000,1000,1000},
            ["reward"]=2,
            ["ratioList"]={-0.03,-0.03,-0.03,-0.03,-0.03,0.1,0.1,0.1,0.1,0.1},
        },
        ["33"]={       ----烟雨楼----陈圆圆
            ["build"]="3",
            ["type"]=2,
            ["wifeId"]="108",
            ["value"]=7,
        },
        ["34"]={       ----烟雨楼----李师师
            ["build"]="3",
            ["type"]=2,
            ["wifeId"]="204",
            ["value"]=16,
            ["needTime"]=86400,
        },
        ["35"]={       ----烟雨楼----董小宛
            ["build"]="3",
            ["type"]=2,
            ["wifeId"]="201",
            ["value"]=10,
            ["needTime"]=86400,
        },
        ["36"]={       ----烟雨楼----柳如是
            ["build"]="3",
            ["type"]=2,
            ["wifeId"]="202",
            ["value"]=12,
            ["needTime"]=86400,
        },
        ["41"]={       ----雍王府----胤禛
            ["build"]="4",
            ["type"]=1,
            ["base"]={1000,0,1000,1000,1000,1000,1000,3000,3000,3000},
            ["reward"]=4,
            ["ratioList"]={0.1,0,0.1,0.1,0.1,0.1,0.1,0.2,0.5,0.2},
        },
        ["42"]={       ----雍王府----年妃
            ["build"]="4",
            ["type"]=2,
            ["wifeId"]="106",
            ["value"]=5,
        },
        ["43"]={       ----雍王府----和硕格格
            ["build"]="4",
            ["type"]=2,
            ["wifeId"]="103",
            ["value"]=4,
        },
        ["44"]={       ----雍王府----李总管
            ["build"]="4",
            ["type"]=1,
            ["base"]={1000,0,1000,0,1000,0,1000,3000,1000,3000},
            ["reward"]=4,
            ["ratioList"]={0.1,0,0.1,0,0.1,0,0.1,0.2,0.1,0.2},
        },
        ["45"]={       ----雍王府----小翠
            ["build"]="4",
            ["type"]=2,
            ["wifeId"]="104",
            ["value"]=4,
        },
        ["51"]={       ----铜雀台----西施
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="303",
            ["value"]=0,
            ["unlock"]={["needVip"]=2},
        },
        ["52"]={       ----铜雀台----貂蝉
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="302",
            ["value"]=0,
            ["unlock"]={["needVip"]=4},
        },
        ["53"]={       ----铜雀台----杨玉环
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="304",
            ["value"]=0,
            ["unlock"]={["needVip"]=6},
        },
        ["54"]={       ----铜雀台----王昭君
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="305",
            ["value"]=0,
            ["unlock"]={["needVip"]=8},
        },
        ["55"]={       ----铜雀台----小乔
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="306",
            ["value"]=0,
            ["unlock"]={["needVip"]=9},
        },
        ["56"]={       ----铜雀台----大乔
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="307",
            ["value"]=0,
            ["unlock"]={["needVip"]=10},
        },
        ["57"]={       ----铜雀台----武则天
            ["build"]="5",
            ["type"]=2,
            ["wifeId"]="308",
            ["value"]=0,
            ["unlock"]={["needVip"]=11},
        },
        ["61"]={       ----天地会----陈近南
            ["build"]="6",
            ["type"]=1,
            ["servantId"]="1029",
            ["base"]={1000,1000,1000,1000,1000,1000,3000,1000,3000,1000},
            ["reward"]=4,
            ["ratioList"]={0.1,0.1,0.1,0.1,0.1,0.1,0.2,0.1,0.2,0.1},
        },
        ["62"]={       ----天地会----小宝
            ["build"]="6",
            ["type"]=1,
            ["servantId"]="1007",
            ["base"]={1000,1000,1000,1000,1000,1000,3000,3000,1000,1000},
            ["reward"]=2,
            ["ratioList"]={0.1,0.1,0.1,0.1,0.1,0.1,0.2,0.2,0.1,0.1},
        },
        ["63"]={       ----天地会----双儿
            ["build"]="6",
            ["type"]=2,
            ["wifeId"]="107",
            ["value"]=6,
        },
        ["64"]={       ----天地会----长平公主
            ["build"]="6",
            ["type"]=2,
            ["wifeId"]="207",
            ["value"]=0,
            ["unlock"]={["needPower"]=50000},
        },
        ["71"]={       ----茶馆----王掌柜
            ["build"]="7",
            ["type"]=1,
            ["base"]={1000,0,1000,0,1000,0,1000,1000,3000,3000},
            ["reward"]=2,
            ["ratioList"]={0.1,0,0.1,0,0.1,0,0.1,0.1,0.2,0.2},
        },
        ["72"]={       ----茶馆----罗姗娜
            ["build"]="7",
            ["type"]=2,
            ["wifeId"]="205",
            ["value"]=18,
            ["needTime"]=86400,
        },
        ["81"]={       ----颜府----颜思齐
            ["build"]="8",
            ["type"]=1,
            ["base"]={1000,0,1000,1000,1000,1000,3000,1000,1000,3000},
            ["reward"]=2,
            ["ratioList"]={0.1,0,0.1,0.1,0.1,0.1,0.2,0.1,0.1,0.2},
        },
        ["82"]={       ----颜府----颜丁
            ["build"]="8",
            ["type"]=1,
            ["base"]={1000,0,1000,0,1000,0,3000,3000,1000,3000},
            ["reward"]=3,
            ["ratioList"]={0.1,0,0.1,0,0.1,0,0.2,0.2,0.1,0.2},
        },
        ["83"]={       ----颜府----颜如玉
            ["build"]="8",
            ["type"]=2,
            ["wifeId"]="109",
            ["value"]=8,
        },
        ["84"]={       ----颜府----阿市
            ["build"]="8",
            ["type"]=2,
            ["wifeId"]="209",
            ["value"]=0,
            ["unlock"]={["needPower"]=500000},
        },
        ["91"]={       ----宰相府----索额图
            ["build"]="9",
            ["type"]=1,
            ["base"]={1000,0,1000,1000,1000,1000,3000,3000,3000,1000},
            ["reward"]=3,
            ["ratioList"]={0.1,0,0.1,0.1,0.1,0.1,0.2,0.2,0.2,0.1},
        },
        ["92"]={       ----宰相府----侍卫
            ["build"]="9",
            ["type"]=1,
            ["base"]={0,0,0,0,0,1000,1000,1000,1000,1000},
            ["reward"]=4,
            ["ratioList"]={-0.03,-0.03,-0.03,-0.03,-0.03,0.1,0.1,0.1,0.1,0.1},
        },
        ["93"]={       ----宰相府----甄宓
            ["build"]="9",
            ["type"]=2,
            ["wifeId"]="210",
            ["value"]=0,
            ["unlock"]={["needPower"]=1000000},
        },
        ["101"]={       ----私塾----唐伯虎
            ["build"]="10",
            ["type"]=1,
            ["servantId"]="1030",
            ["base"]={1000,1000,1000,1000,1000,1000,1000,3000,1000,3000},
            ["reward"]=3,
            ["ratioList"]={0.1,0.1,0.1,0.1,0.1,0.1,0.1,0.2,0.1,0.5},
        },
        ["102"]={       ----私塾----上官婉儿
            ["build"]="10",
            ["type"]=2,
            ["wifeId"]="310",
            ["value"]=0,
            ["unlock"]={["needQQ"]=1},
        },
        ["111"]={       ----大观园----贾母
            ["build"]="11",
            ["type"]=1,
            ["base"]={1000,0,1000,0,1000,0,1000,1000,3000,3000},
            ["reward"]=4,
            ["ratioList"]={0.1,0,0.1,0,0.1,0,0.1,0.1,0.2,0.2},
        },
        ["112"]={       ----大观园----薛宝钗
            ["build"]="11",
            ["type"]=2,
            ["wifeId"]="203",
            ["value"]=14,
            ["needTime"]=86400,
        },
        ["113"]={       ----大观园----林黛玉
            ["build"]="11",
            ["type"]=2,
            ["wifeId"]="105",
            ["value"]=4,
        },
    },
    
    --建筑列表
      --icon  图标
      --name  名字
    buildList={
        ["1"]={       ----草庐
            ["icon"]="search_icon1",
            ["name"]="searchBuild1",
        },
        ["2"]={       ----客栈
            ["icon"]="search_icon2",
            ["name"]="searchBuild2",
        },
        ["3"]={       ----烟雨楼
            ["icon"]="search_icon3",
            ["name"]="searchBuild3",
        },
        ["4"]={       ----雍王府
            ["icon"]="search_icon4",
            ["name"]="searchBuild4",
        },
        ["5"]={       ----铜雀台
            ["icon"]="search_icon5",
            ["name"]="searchBuild5",
        },
        ["6"]={       ----天地会
            ["icon"]="search_icon6",
            ["name"]="searchBuild6",
        },
        ["7"]={       ----茶馆
            ["icon"]="search_icon7",
            ["name"]="searchBuild7",
        },
        ["8"]={       ----颜府
            ["icon"]="search_icon8",
            ["name"]="searchBuild8",
        },
        ["9"]={       ----宰相府
            ["icon"]="search_icon9",
            ["name"]="searchBuild9",
        },
        ["10"]={       ----私塾
            ["icon"]="search_icon10",
            ["name"]="searchBuild10",
        },
        ["11"]={       ----大观园
            ["icon"]="search_icon11",
            ["name"]="searchBuild11",
        },
    },
}
return searchCfg
