--皇宫建筑配置
local buildingCfg={
      --sortId  顺序
      --unlock  建筑是否开放  0：不开放  1：开放
      --title  对应称号
    
    ["1"]={       ----凌霄殿----1
        ["sortId"]=1,["unlock"]=0,["title"]={"3101"},
    },
    ["11"]={       ----仁帝殿----11
        ["sortId"]=11,["unlock"]=0,["title"]={"3102"},
    },
    ["12"]={       ----政帝殿----12
        ["sortId"]=12,["unlock"]=0,["title"]={"3103"},
    },
    ["13"]={       ----礼帝殿----13
        ["sortId"]=13,["unlock"]=0,["title"]={"3104"},
    },
    ["14"]={       ----文帝殿----14
        ["sortId"]=14,["unlock"]=1,["title"]={"3105"},
    },
    ["15"]={       ----义帝殿----15
        ["sortId"]=15,["unlock"]=0,["title"]={"3106"},
    },
    ["16"]={       ----武帝殿----16
        ["sortId"]=16,["unlock"]=1,["title"]={"3000"},
    },
    ["31"]={       ----金銮殿----31
        ["sortId"]=31,["unlock"]=1,["title"]={"3201"},
    },
    ["41"]={       ----摄政王府----41
        ["sortId"]=41,["unlock"]=1,["title"]={"3001"},
    },
    ["42"]={       ----文宣王府----42
        ["sortId"]=42,["unlock"]=1,["title"]={"3002"},
    },
    ["43"]={       ----平西王府----43
        ["sortId"]=43,["unlock"]=1,["title"]={"3003"},
    },
    ["44"]={       ----镇南王府----44
        ["sortId"]=44,["unlock"]=1,["title"]={"3004"},
    },
    ["45"]={       ----武成王府----45
        ["sortId"]=45,["unlock"]=1,["title"]={"3005"},
    },
    ["46"]={       ----靖安王府----46
        ["sortId"]=46,["unlock"]=1,["title"]={"3202"},
    },
    ["47"]={       ----八贤王府----47
        ["sortId"]=47,["unlock"]=1,["title"]={"3203"},
    },
    ["48"]={       ----逍遥王府----48
        ["sortId"]=48,["unlock"]=1,["title"]={"3204"},
    },
    ["49"]={       ----宣烈王府----49
        ["sortId"]=49,["unlock"]=0,["title"]={"3205"},
    },
    ["61"]={       ----公爵府----61
        ["sortId"]=61,["unlock"]=1,["title"]={"3304","3305","3306","3307","3006","3301","3302","3303","3007","3008","3009","3010"},
    },
    ["62"]={       ----军机处----63
        ["sortId"]=63,["unlock"]=1,
    },
    ["63"]={       ----侯爵府----62
        ["sortId"]=62,["unlock"]=1,["title"]={"3401","3402","3403","3404"},
    },
}
return buildingCfg
