--道具合成配置
local composeCfg={
      --itemId  合成道具ID
      --timeLimit  是否限时  1:限时  0：不限时
      --lastTime  持续时间  单位：秒
      --composeLimit  合成上限  在持续时间内，只能合成X个
      --needGem  合成所需元宝
      --needItem  合成所需
    
    [0]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [1]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["5"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["6"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["7"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["8"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["9"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["10"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["11"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["12"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["13"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["14"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["15"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["16"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["17"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["18"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [2]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----奸臣令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["5"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["6"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["7"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["8"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["9"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["10"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["11"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["12"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["13"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["14"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["15"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["16"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["17"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["18"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [3]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
        ["20"]={       ----强盟令----1911
            ["itemId"]="1911",["timeLimit"]=1,["composeLimit"]=20,["needItem"]={["1910"]=4},
        },
    },
    [4]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [5]={
        ["1"]={       ----追杀令----1553
            ["itemId"]="1553",["timeLimit"]=1,["composeLimit"]=100,["needItem"]={["1554"]=4},
        },
        ["2"]={       ----挑战书----1552
            ["itemId"]="1552",["timeLimit"]=1,["composeLimit"]=3,["needGem"]=200,["needItem"]={["1551"]=1},
        },
        ["3"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["4"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["5"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["7"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["8"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["9"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["10"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["11"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["12"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["13"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["14"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["15"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["16"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["17"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["18"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["19"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["20"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["21"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [6]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [7]={
        ["1"]={       ----比翼鸟----1402
            ["itemId"]="1402",["timeLimit"]=1,["composeLimit"]=2,["needGem"]=250,["needItem"]={["1401"]=1},
        },
        ["2"]={       ----鸳鸯玉----1403
            ["itemId"]="1403",["timeLimit"]=1,["composeLimit"]=1,["needGem"]=450,["needItem"]={["1402"]=1},
        },
        ["3"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["4"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["5"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["7"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["8"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["9"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["10"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["11"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["12"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["13"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["14"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["15"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["16"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["17"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["18"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["19"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["20"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["21"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [8]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [9]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["5"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["6"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["7"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["8"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["9"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["10"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["11"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["12"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["13"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["14"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["15"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["16"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["17"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["18"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [10]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
        ["20"]={       ----比翼鸟----1402
            ["itemId"]="1402",["timeLimit"]=1,["composeLimit"]=2,["needGem"]=250,["needItem"]={["1401"]=1},
        },
        ["21"]={       ----鸳鸯玉----1403
            ["itemId"]="1403",["timeLimit"]=1,["composeLimit"]=1,["needGem"]=450,["needItem"]={["1402"]=1},
        },
    },
    [11]={
        ["1"]={       ----强盟令----1911
            ["itemId"]="1911",["timeLimit"]=1,["composeLimit"]=20,["needItem"]={["1910"]=4},
        },
        ["2"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["3"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["4"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["7"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["8"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["9"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["10"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["11"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["12"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["13"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["14"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["15"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["16"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["17"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["18"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["19"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["20"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [12]={
        ["1"]={       ----追杀令----1553
            ["itemId"]="1553",["timeLimit"]=1,["composeLimit"]=100,["needItem"]={["1554"]=4},
        },
        ["2"]={       ----挑战书----1552
            ["itemId"]="1552",["timeLimit"]=1,["composeLimit"]=3,["needGem"]=200,["needItem"]={["1551"]=1},
        },
        ["3"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["4"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["5"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["7"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["8"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["9"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["10"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["11"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["12"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["13"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["14"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["15"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["16"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["17"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["18"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["19"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["20"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["21"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [13]={
        ["1"]={       ----追杀令----1553
            ["itemId"]="1553",["timeLimit"]=1,["composeLimit"]=100,["needItem"]={["1554"]=4},
        },
        ["2"]={       ----挑战书----1552
            ["itemId"]="1552",["timeLimit"]=1,["composeLimit"]=3,["needGem"]=200,["needItem"]={["1551"]=1},
        },
        ["3"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["4"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["5"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["7"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["8"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["9"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["10"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["11"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["12"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["13"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["14"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["15"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["16"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["17"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["18"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["19"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["20"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["21"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
    [14]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["5"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["6"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["7"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["8"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["9"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["10"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["11"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["12"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["13"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["14"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["15"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["16"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["17"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["18"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
        ["19"]={       ----比翼鸟----1402
            ["itemId"]="1402",["timeLimit"]=1,["composeLimit"]=2,["needGem"]=250,["needItem"]={["1401"]=1},
        },
        ["20"]={       ----鸳鸯玉----1403
            ["itemId"]="1403",["timeLimit"]=1,["composeLimit"]=1,["needGem"]=450,["needItem"]={["1402"]=1},
        },
    },
    [15]={
        ["1"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["2"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["3"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["4"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["5"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["6"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["7"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["8"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["9"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["10"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["11"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["12"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["13"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["14"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["15"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["16"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["17"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["18"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["19"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
        ["20"]={       ----比翼鸟----1402
            ["itemId"]="1402",["timeLimit"]=1,["composeLimit"]=2,["needGem"]=250,["needItem"]={["1401"]=1},
        },
        ["21"]={       ----鸳鸯玉----1403
            ["itemId"]="1403",["timeLimit"]=1,["composeLimit"]=1,["needGem"]=450,["needItem"]={["1402"]=1},
        },
    },
    [16]={
        ["1"]={       ----追杀令----1553
            ["itemId"]="1553",["timeLimit"]=1,["composeLimit"]=100,["needItem"]={["1554"]=4},
        },
        ["2"]={       ----挑战书----1552
            ["itemId"]="1552",["timeLimit"]=1,["composeLimit"]=3,["needGem"]=200,["needItem"]={["1551"]=1},
        },
        ["3"]={       ----卷轴礼包----1150
            ["itemId"]="1150",["timeLimit"]=0,["needItem"]={["1161"]=4},
        },
        ["4"]={       ----高级强盟令----1912
            ["itemId"]="1912",["timeLimit"]=0,["needItem"]={["1911"]=3},
        },
        ["5"]={       ----谋士令----2001
            ["itemId"]="2001",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["6"]={       ----奸臣令----2002
            ["itemId"]="2002",["timeLimit"]=0,["needItem"]={["2000"]=8},
        },
        ["7"]={       ----子爵服饰----1704
            ["itemId"]="1704",["timeLimit"]=0,["needItem"]={["1701"]=3},
        },
        ["8"]={       ----子爵发冠----1705
            ["itemId"]="1705",["timeLimit"]=0,["needItem"]={["1702"]=3},
        },
        ["9"]={       ----子爵衿带----1706
            ["itemId"]="1706",["timeLimit"]=0,["needItem"]={["1703"]=3},
        },
        ["10"]={       ----伯爵服饰----1707
            ["itemId"]="1707",["timeLimit"]=0,["needItem"]={["1704"]=3},
        },
        ["11"]={       ----伯爵发冠----1708
            ["itemId"]="1708",["timeLimit"]=0,["needItem"]={["1705"]=3},
        },
        ["12"]={       ----伯爵衿带----1709
            ["itemId"]="1709",["timeLimit"]=0,["needItem"]={["1706"]=3},
        },
        ["13"]={       ----侯爵服饰----1710
            ["itemId"]="1710",["timeLimit"]=0,["needItem"]={["1707"]=4},
        },
        ["14"]={       ----侯爵发冠----1711
            ["itemId"]="1711",["timeLimit"]=0,["needItem"]={["1708"]=4},
        },
        ["15"]={       ----侯爵衿带----1712
            ["itemId"]="1712",["timeLimit"]=0,["needItem"]={["1709"]=4},
        },
        ["16"]={       ----公爵服饰----1713
            ["itemId"]="1713",["timeLimit"]=0,["needItem"]={["1710"]=5},
        },
        ["17"]={       ----公爵发冠----1714
            ["itemId"]="1714",["timeLimit"]=0,["needItem"]={["1711"]=5},
        },
        ["18"]={       ----公爵衿带----1715
            ["itemId"]="1715",["timeLimit"]=0,["needItem"]={["1712"]=5},
        },
        ["19"]={       ----王爵服饰----1716
            ["itemId"]="1716",["timeLimit"]=0,["needItem"]={["1713"]=6},
        },
        ["20"]={       ----王爵发冠----1717
            ["itemId"]="1717",["timeLimit"]=0,["needItem"]={["1714"]=6},
        },
        ["21"]={       ----王爵衿带----1718
            ["itemId"]="1718",["timeLimit"]=0,["needItem"]={["1715"]=6},
        },
    },
}
return composeCfg
