--本服称帝战配置
local emperorWarCfg={
    --称帝战开启条件1：服务器大于30天
    condition1=30,
    
    --称帝战开启条件2：名望>1000的人数达到 X 人 
    condition2=4,
    
    --称帝战开启条件3：只会在每周五开启称帝战
    condition3=5,
    
    --称帝战第二次以及后续开启间隔  14天，每两周开启一次
    secondTime=14,
    
    --竞拍开启时间:周五22点
    auctionTime=22,
    
    --助威开启时间：周六21点
    cheerTime=21,
    
    --战斗开启时间：周日21点
    battleTime=21,
    
    --每场战斗持续时间  单位：秒
    battlelastTime=1200,
    
    --报名条件：名望大于等于1000
    limit=1000,
    
    --报名最低限制：1000人望币
    enterMin=1000,
    
    --助威的等级限制  官职达到X，才能助威
    cheerLv=7,
    
    --助威消耗 元宝  超过最大值取最大值
    cheerCost={300,600,1000,2000,3000,4000,5000,6000,7000,8000,9000,10000},
    
    --每次助威获得X人气
    cheerEffect=1,
    
    --助威后，人气高的一方获得先手，以及攻击加成 X%
    cheerAddAtk=0.1,
    
      --rank  排名上限
      --return  返还人望币的比例
      --getReward  排名奖励
    
    rankRewardList={
        ["1"]={       ----第一名
            ["rank"]={1,1},["return"]=0.9,["getReward"]="6_1751_1|6_1403_1|6_1402_1|6_1401_2|6_1151_1|6_1152_1|6_1153_1|6_1154_1|6_1217_1|6_1218_1|6_1219_1|6_1220_1|6_1701_15|6_1702_15|6_1703_15",
        },
        ["2"]={       ----第二名
            ["rank"]={2,2},["return"]=0.8,["getReward"]="6_1751_1|6_1403_1|6_1402_1|6_1401_1|6_1151_1|6_1152_1|6_1153_1|6_1154_1|6_1216_1|6_1201_3|6_1701_12|6_1702_12|6_1703_12",
        },
        ["3"]={       ----第3--4名
            ["rank"]={3,4},["return"]=0.6,["getReward"]="6_1751_1|6_1402_1|6_1401_1|6_1151_1|6_1152_1|6_1153_1|6_1154_1|6_1701_9|6_1702_9|6_1703_9",
        },
        ["4"]={       ----第5--8名
            ["rank"]={5,8},["return"]=0.5,["getReward"]="6_1751_1|6_1401_1|6_1150_1|6_1202_1|6_1203_1|6_1204_1|6_1205_1|6_1701_6|6_1702_6|6_1703_6",
        },
    },
    
      --winNum  助威对象获胜X场
      --getReward  助威奖励   最终奖励 = getReward * 助威次数
    
    cheerRewardList={
        ["1"]={       ----称帝--助威对象获胜3场
            ["winNum"]=3,["getReward"]="6_1150_1|6_1201_2|6_1206_3|6_1001_10|6_1003_10",
        },
        ["2"]={       ----助威对象获胜2场
            ["winNum"]=2,["getReward"]="6_1161_1|6_1201_2|6_1206_3|6_1001_7|6_1003_7",
        },
        ["3"]={       ----助威对象获胜1场
            ["winNum"]=1,["getReward"]="6_1201_1|6_1206_2|6_1211_5|6_1001_5|6_1003_5",
        },
        ["4"]={       ----助威对象获胜0场
            ["winNum"]=0,["getReward"]="6_1201_1|6_1206_1|6_1211_3|6_1001_3|6_1003_3",
        },
    },
    
    --称帝战商店
      --sortId  显示顺序 
      --limit  限购次数  活动期间总次数  只有能参战的8人可购买
      --preCost  道具原价
      --buyCost  实际购买的价格
      --discount  折扣
      --content  内容和数量
    
    shop={
        ["1001"]={       ----武力强化卷轴
            ["sortId"]=1001,["limit"]=10,["preCost"]=600,["buyCost"]=300,["discount"]=0.5,["content"]="6_1151_1",
        },
        ["1002"]={       ----智力强化卷轴
            ["sortId"]=1002,["limit"]=10,["preCost"]=600,["buyCost"]=300,["discount"]=0.5,["content"]="6_1152_1",
        },
        ["1003"]={       ----政治强化卷轴
            ["sortId"]=1003,["limit"]=10,["preCost"]=600,["buyCost"]=300,["discount"]=0.5,["content"]="6_1153_1",
        },
        ["1004"]={       ----魅力强化卷轴
            ["sortId"]=1004,["limit"]=10,["preCost"]=600,["buyCost"]=300,["discount"]=0.5,["content"]="6_1154_1",
        },
        ["1005"]={       ----卷轴礼包
            ["sortId"]=1005,["limit"]=30,["preCost"]=600,["buyCost"]=480,["discount"]=0.8,["content"]="6_1150_1",
        },
        ["1006"]={       ----属性果
            ["sortId"]=1006,["limit"]=20,["preCost"]=1000,["buyCost"]=500,["discount"]=0.5,["content"]="6_1216_1",
        },
        ["1007"]={       ----书籍经验包
            ["sortId"]=1007,["limit"]=50,["preCost"]=50,["buyCost"]=25,["discount"]=0.5,["content"]="6_1020_1",
        },
        ["1008"]={       ----书籍经验包
            ["sortId"]=1008,["limit"]=100,["preCost"]=50,["buyCost"]=40,["discount"]=0.8,["content"]="6_1020_1",
        },
        ["1009"]={       ----技能经验包
            ["sortId"]=1009,["limit"]=50,["preCost"]=50,["buyCost"]=25,["discount"]=0.5,["content"]="6_1030_1",
        },
        ["1010"]={       ----技能经验包
            ["sortId"]=1010,["limit"]=100,["preCost"]=50,["buyCost"]=40,["discount"]=0.8,["content"]="6_1030_1",
        },
        ["1011"]={       ----征收令
            ["sortId"]=1011,["limit"]=10,["preCost"]=200,["buyCost"]=100,["discount"]=0.5,["content"]="6_1101_1",
        },
        ["1012"]={       ----征收令
            ["sortId"]=1012,["limit"]=20,["preCost"]=200,["buyCost"]=160,["discount"]=0.8,["content"]="6_1101_1",
        },
    },
    
}
return emperorWarCfg
