--3k发送礼包配置
local giftby3kCfg={
      --mail  邮件编号
      --rewards  使用效果
    ["1001"]={    ----上线强化礼包
        ["rewards"]="6_1206_1|6_1207_1|6_1208_1",
        ["mail"]={
            ["0"]={title="上线强化礼包",content="欢迎来到《极品大官人》您获得上线强化礼包：属性丸*1，武力丸*1，智力丸*1，祝您游戏愉快。"},
        },
    },
    ["1002"]={    ----从八品礼包
        ["rewards"]="1_1_50|6_1001_2|6_1003_2",
        ["mail"]={
            ["0"]={title="从八品礼包",content="恭喜您加官进爵达到从八品职位，您获得从八品礼包：元宝*50，银票*2，兵符*2，祝您步步高升。"},
        },
    },
    ["1003"]={    ----从七品礼包
        ["rewards"]="1_1_50|6_1207_1|6_1208_1",
        ["mail"]={
            ["0"]={title="从七品礼包",content="恭喜您加官进爵达到从七品职位，您获得从七品礼包：元宝*50，武力丸*1，智力丸*1，祝您步步高升。"},
        },
    },
    ["1004"]={    ----从六品礼包
        ["rewards"]="1_1_100|6_1010_1|6_1206_1",
        ["mail"]={
            ["0"]={title="从六品礼包",content="恭喜您加官进爵达到从六品职位，您获得从六品礼包：元宝*100，百宝袋*1，属性丸*1，祝您步步高升。"},
        },
    },
    ["1005"]={    ----正六品礼包
        ["rewards"]="6_1151_1|6_1010_1|6_1206_1",
        ["mail"]={
            ["0"]={title="正六品礼包",content="恭喜您加官进爵达到正六品职位，您获得正六品礼包：武力强化卷轴*1，百宝袋*1，属性丸*1，祝您步步高升。"},
        },
    },
    ["1006"]={    ----幸运礼包
        ["rewards"]="6_1201_1|6_1005_1|6_1006_1",
        ["mail"]={
            ["0"]={title="幸运礼包",content="恭喜您获得幸运礼包：属性丹*1，黑市银票*1，黑市兵符*1，祝您游戏愉快。"},
        },
    },
}
return giftby3kCfg
