--邀请配置
local inviteFriendCfg={
      --needNum  邀请人数要求
      --content  内容和数量
    friendNum={    ----邀请好友X个，领取奖励
        ["1"]={       ----需要邀请 1 位好友
            ["needNum"]=1,["content"]="6_1202_1|6_1211_1",
        },
        ["2"]={       ----需要邀请 2 位好友
            ["needNum"]=2,["content"]="6_1001_1|6_1211_1",
        },
        ["3"]={       ----需要邀请 3 位好友
            ["needNum"]=3,["content"]="6_1003_1|6_1211_1",
        },
        ["4"]={       ----需要邀请 4 位好友
            ["needNum"]=4,["content"]="6_1030_1|6_1211_1",
        },
        ["5"]={       ----需要邀请 5 位好友
            ["needNum"]=5,["content"]="6_1203_1|6_1211_1",
        },
        ["6"]={       ----需要邀请 6 位好友
            ["needNum"]=6,["content"]="6_1212_1|6_1211_1",
        },
        ["7"]={       ----需要邀请 7 位好友
            ["needNum"]=7,["content"]="6_1020_1|6_1211_1",
        },
        ["8"]={       ----需要邀请 8 位好友
            ["needNum"]=8,["content"]="6_1213_1|6_1211_1",
        },
        ["9"]={       ----需要邀请 9 位好友
            ["needNum"]=9,["content"]="6_1214_1|6_1211_1",
        },
        ["10"]={       ----需要邀请 10 位好友
            ["needNum"]=10,["content"]="6_1501_1|6_1502_1",
        },
        ["11"]={       ----需要邀请 11 位好友
            ["needNum"]=11,["content"]="6_1212_1|6_1211_1",
        },
        ["12"]={       ----需要邀请 12 位好友
            ["needNum"]=12,["content"]="6_1205_1|6_1211_1",
        },
        ["13"]={       ----需要邀请 13 位好友
            ["needNum"]=13,["content"]="6_1003_1|6_1211_1",
        },
        ["14"]={       ----需要邀请 14 位好友
            ["needNum"]=14,["content"]="6_1215_1|6_1211_1",
        },
        ["15"]={       ----需要邀请 15 位好友
            ["needNum"]=15,["content"]="6_1501_1|6_1502_1",
        },
        ["16"]={       ----需要邀请 16 位好友
            ["needNum"]=16,["content"]="6_1212_1|6_1211_1",
        },
        ["17"]={       ----需要邀请 17 位好友
            ["needNum"]=17,["content"]="6_1001_1|6_1211_1",
        },
        ["18"]={       ----需要邀请 18 位好友
            ["needNum"]=18,["content"]="6_1004_1|6_1211_1",
        },
        ["19"]={       ----需要邀请 19 位好友
            ["needNum"]=19,["content"]="6_1213_1|6_1211_1",
        },
        ["20"]={       ----需要邀请 20 位好友
            ["needNum"]=20,["content"]="6_1501_1|6_1502_1",
        },
        ["21"]={       ----需要邀请 21 位好友
            ["needNum"]=21,["content"]="6_1003_1|6_1211_1",
        },
        ["22"]={       ----需要邀请 22 位好友
            ["needNum"]=22,["content"]="6_1212_1|6_1211_1",
        },
        ["23"]={       ----需要邀请 23 位好友
            ["needNum"]=23,["content"]="6_1551_1|6_1211_1",
        },
        ["24"]={       ----需要邀请 24 位好友
            ["needNum"]=24,["content"]="6_1213_1|6_1211_1",
        },
        ["25"]={       ----需要邀请 25 位好友
            ["needNum"]=25,["content"]="6_1501_1|6_1502_1",
        },
        ["26"]={       ----需要邀请 26 位好友
            ["needNum"]=26,["content"]="6_1001_1|6_1211_1",
        },
        ["27"]={       ----需要邀请 27 位好友
            ["needNum"]=27,["content"]="6_1090_1|6_1211_1",
        },
        ["28"]={       ----需要邀请 28 位好友
            ["needNum"]=28,["content"]="6_1212_1|6_1211_1",
        },
        ["29"]={       ----需要邀请 29 位好友
            ["needNum"]=29,["content"]="6_1213_1|6_1211_1",
        },
        ["30"]={       ----需要邀请 30 位好友
            ["needNum"]=30,["content"]="6_1501_1|6_1502_1",
        },
    },
    
      --needRecharge  所需达到的充值额度  单位：元宝
      --limit  限制可领奖次数
      --content  内容和数量
    friendRecharge={    ----好友充值达到X，领取奖励
        ["1"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=60,["limit"]=10,["content"]="6_1201_1|6_1051_1",
        },
        ["2"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=300,["limit"]=8,["content"]="6_1020_1|6_1040_1",
        },
        ["3"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=680,["limit"]=6,["content"]="1_1_100|6_1052_1",
        },
        ["4"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=1980,["limit"]=5,["content"]="1_1_100|6_1552_1",
        },
        ["5"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=3280,["limit"]=4,["content"]="1_1_100|6_1090_1",
        },
        ["6"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=6480,["limit"]=3,["content"]="1_1_200|6_1004_1",
        },
        ["7"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=10000,["limit"]=2,["content"]="1_1_300|6_1751_1",
        },
        ["8"]={       ----单个好友需要充值达到 X
            ["needRecharge"]=20000,["limit"]=1,["content"]="16_3101_1|6_1150_1|6_1030_5",
        },
    },
    
      --needPower  所需达到的权势值
      --limit  限制可领奖次数
      --content  内容和数量
    friendPower={    ----好友权势达到X，领取奖励
        ["1"]={       ----单个好友需要权势达到 X
            ["needPower"]=50000,["limit"]=10,["content"]="6_1351_1|6_1353_1",
        },
        ["2"]={       ----单个好友需要权势达到 X
            ["needPower"]=200000,["limit"]=8,["content"]="6_1352_1|6_1354_1",
        },
        ["3"]={       ----单个好友需要权势达到 X
            ["needPower"]=500000,["limit"]=6,["content"]="6_1303_1|6_1352_2",
        },
        ["4"]={       ----单个好友需要权势达到 X
            ["needPower"]=1000000,["limit"]=5,["content"]="6_1301_1|6_1354_2",
        },
        ["5"]={       ----单个好友需要权势达到 X
            ["needPower"]=5000000,["limit"]=4,["content"]="6_1302_1|6_1352_3",
        },
        ["6"]={       ----单个好友需要权势达到 X
            ["needPower"]=10000000,["limit"]=3,["content"]="6_1303_1|6_1354_3",
        },
        ["7"]={       ----单个好友需要权势达到 X
            ["needPower"]=50000000,["limit"]=2,["content"]="6_1303_2|6_1352_4",
        },
        ["8"]={       ----单个好友需要权势达到 X
            ["needPower"]=100000000,["limit"]=1,["content"]="6_1303_3|6_1354_4",
        },
    },
}
return inviteFriendCfg
