--道具配置
local itemCfg={
      --type  类型  1：道具 2：合成 3：时装
      --quality  品质  1：白  2：绿 3：蓝 4：紫 5：红 6：粉 7：黄
      --sortId  排序  在包裹中的排序，数字越小越靠前，相同时 以Id顺序为准
      --howToGet  产出路径，决定在功能中，道具不足时的跳转  1：商城 2：后续增加其余类型
      --lastTime  活动结束后，道具在背包中的存在时间  单位：秒
      --isUse  是否可用
      --target  目标  1:角色 2：门客 3：红颜
      --dropId  随机表ID  引用itemDropCfg中ID
      --getRewards  使用效果
    
    ["1001"]={       ----银票----使用后获得10万银两
        ["type"]=1,["quality"]=1,["sortId"]=11,["howToGet"]=1,["isUse"]=1,["target"]=1,["getRewards"]="2_1_100000",
    },
    ["1002"]={       ----粮票----使用后获得10万粮草
        ["type"]=1,["quality"]=1,["sortId"]=12,["howToGet"]=1,["isUse"]=1,["target"]=1,["getRewards"]="3_1_100000",
    },
    ["1003"]={       ----兵符----使用后获得10万士兵
        ["type"]=1,["quality"]=1,["sortId"]=13,["howToGet"]=1,["isUse"]=1,["target"]=1,["getRewards"]="4_1_100000",
    },
    ["1004"]={       ----政绩礼包----使用后获得50点政绩
        ["type"]=1,["quality"]=3,["sortId"]=31,["isUse"]=1,["target"]=1,["getRewards"]="5_1_50",
    },
    ["1005"]={       ----黑市银票----使用后有几率获得888~8888888银两
        ["type"]=1,["quality"]=3,["sortId"]=21,["isUse"]=1,["target"]=1,["dropId"]={"1"},
    },
    ["1006"]={       ----黑市兵符----使用后有几率获得888~8888888士兵
        ["type"]=1,["quality"]=3,["sortId"]=22,["isUse"]=1,["target"]=1,["dropId"]={"2"},
    },
    ["1007"]={       ----政绩礼盒----使用后获得500点政绩
        ["type"]=1,["quality"]=7,["sortId"]=32,["isUse"]=1,["target"]=1,["getRewards"]="5_1_500",
    },
    ["1010"]={       ----百宝袋----有概率获得2倍、5倍、10倍资源以及强化卷轴
        ["type"]=1,["quality"]=4,["sortId"]=14,["isUse"]=1,["target"]=1,["dropId"]={"3"},
    },
    ["1011"]={       ----御赐国公礼盒----使用后随机获得国公称号一个
        ["type"]=1,["quality"]=7,["sortId"]=15,["isUse"]=1,["target"]=1,["dropId"]={"16"},
    },
    ["1012"]={       ----生日快乐----使用后有几率获得元宝、属性果、属性丹、属性丸、书籍经验包、技能经验包
        ["type"]=1,["quality"]=4,["sortId"]=16,["isUse"]=1,["target"]=1,["dropId"]={"25"},
    },
    ["1020"]={       ----书籍经验包----增加门客50点书籍经验
        ["type"]=1,["quality"]=3,["sortId"]=42,["isUse"]=1,["target"]=2,["getRewards"]="14_1_50",
    },
    ["1021"]={       ----书籍经验书----使用后随机门客获得5~1000书籍经验
        ["type"]=1,["quality"]=2,["sortId"]=41,["isUse"]=1,["target"]=2,["dropId"]={"12"},
    },
    ["1029"]={       ----技能经验书----使用后随机门客获得5~1000技能经验
        ["type"]=1,["quality"]=2,["sortId"]=43,["isUse"]=1,["target"]=2,["dropId"]={"13"},
    },
    ["1030"]={       ----技能经验包----增加门客50点技能经验
        ["type"]=1,["quality"]=3,["sortId"]=44,["isUse"]=1,["target"]=2,["getRewards"]="15_1_50",
    },
    ["1031"]={       ----元宝红包----使用后有几率获得10~1000元宝
        ["type"]=1,["quality"]=4,["sortId"]=16,["isUse"]=1,["target"]=1,["dropId"]={"4"},
    },
    ["1032"]={       ----金鸡红包----使用后有几率获得卷轴礼包、封爵道具
        ["type"]=1,["quality"]=4,["sortId"]=17,["isUse"]=1,["target"]=1,["dropId"]={"5"},
    },
    ["1033"]={       ----元芳的小收藏----使用后有几率获得连理枝、比翼鸟、鸳鸯玉
        ["type"]=1,["quality"]=4,["sortId"]=18,["isUse"]=1,["target"]=1,["dropId"]={"6"},
    },
    ["1040"]={       ----原谅绿帽----使用后有几率获得属性散、属性丸、属性丹
        ["type"]=1,["quality"]=2,["sortId"]=25,["isUse"]=1,["target"]=1,["dropId"]={"7"},
    },
    ["1041"]={       ----白底碎花鞋----使用后有几率获得属性散、属性丸、属性丹、征收令、政务令
        ["type"]=1,["quality"]=3,["sortId"]=26,["isUse"]=1,["target"]=1,["dropId"]={"8"},
    },
    ["1042"]={       ----霓裳羽衣----使用后有几率获得属性丹、政绩礼包、书籍经验包、技能经验包
        ["type"]=1,["quality"]=4,["sortId"]=27,["isUse"]=1,["target"]=1,["dropId"]={"9"},
    },
    ["1043"]={       ----鸳鸯锦缎----使用后有几率获得卷轴残卷、卷轴礼包、属性果、男爵服饰、男爵发冠、男爵衿带
        ["type"]=1,["quality"]=7,["sortId"]=28,["isUse"]=1,["target"]=1,["dropId"]={"10"},
    },
    ["1044"]={       ----小钱袋----使用后几率获得木簪、金簪、玛瑙心、翡翠心
        ["type"]=1,["quality"]=2,["sortId"]=29,["isUse"]=1,["target"]=1,
    },
    ["1045"]={       ----私房钱----使用后几率获得体力丹、精力丹、活力丹、金簪、翡翠心
        ["type"]=1,["quality"]=3,["sortId"]=30,["isUse"]=1,["target"]=1,
    },
    ["1046"]={       ----俸禄包----使用后有几率获得属性丹、政绩礼包、书籍经验包、技能经验包
        ["type"]=1,["quality"]=4,["sortId"]=31,["isUse"]=1,["target"]=1,
    },
    ["1051"]={       ----压岁钱----使用后有几率获得木簪、金簪、玛瑙心、翡翠心
        ["type"]=1,["quality"]=2,["sortId"]=51,["isUse"]=1,["target"]=1,["dropId"]={"17"},
    },
    ["1052"]={       ----新衣服----使用后有几率获得体力丹、精力丹、活力丹
        ["type"]=1,["quality"]=3,["sortId"]=52,["isUse"]=1,["target"]=1,["dropId"]={"18"},
    },
    ["1053"]={       ----女儿红----使用后有几率获得政绩礼包、书籍经验包、技能经验包、书籍经验书、技能经验书
        ["type"]=1,["quality"]=4,["sortId"]=53,["isUse"]=1,["target"]=1,["dropId"]={"19"},
    },
    ["1054"]={       ----年夜饭----使用后有几率获得连理枝、比翼鸟、鸳鸯玉
        ["type"]=1,["quality"]=7,["sortId"]=54,["isUse"]=1,["target"]=1,["dropId"]={"20"},
    },
    ["1055"]={       ----道谢丝巾----使用后几率获得木簪、金簪、玛瑙心、翡翠心
        ["type"]=1,["quality"]=2,["sortId"]=55,["isUse"]=1,["target"]=1,["dropId"]={"21"},
    },
    ["1056"]={       ----感恩香囊----使用后几率获得体力丹、精力丹、活力丹、金簪、翡翠心
        ["type"]=1,["quality"]=3,["sortId"]=56,["isUse"]=1,["target"]=1,["dropId"]={"22"},
    },
    ["1057"]={       ----爱意发簪----使用后几率获得亲密香囊、魅力香囊
        ["type"]=1,["quality"]=4,["sortId"]=57,["isUse"]=1,["target"]=1,["dropId"]={"23"},
    },
    ["1058"]={       ----定情玉镯----使用后有几率获得连理枝、比翼鸟、鸳鸯玉
        ["type"]=1,["quality"]=7,["sortId"]=58,["isUse"]=1,["target"]=1,["dropId"]={"24"},
    },
    ["1090"]={       ----出战令----使用后恢复门客副本、关卡BOSS出战次数
        ["type"]=1,["quality"]=3,["sortId"]=113,["isUse"]=0,
    },
    ["1101"]={       ----征收令----使用后额外获得1次经营机会
        ["type"]=1,["quality"]=2,["sortId"]=111,["howToGet"]=1,["isUse"]=0,
    },
    ["1102"]={       ----政务令----使用后额外获得1次处理政务机会
        ["type"]=1,["quality"]=2,["sortId"]=112,["howToGet"]=1,["isUse"]=0,
    },
    ["1150"]={       ----卷轴礼包----使用后随即获得1本强化卷轴
        ["type"]=1,["quality"]=4,["sortId"]=91,["howToGet"]=1,["isUse"]=1,["target"]=1,["dropId"]={"11"},
    },
    ["1151"]={       ----武力强化卷轴----提升门客武力书籍等级
        ["type"]=1,["quality"]=4,["sortId"]=121,["isUse"]=0,
    },
    ["1152"]={       ----智力强化卷轴----提升门客智力书籍等级
        ["type"]=1,["quality"]=4,["sortId"]=122,["isUse"]=0,
    },
    ["1153"]={       ----政治强化卷轴----提升门客政治书籍等级
        ["type"]=1,["quality"]=4,["sortId"]=123,["isUse"]=0,
    },
    ["1154"]={       ----魅力强化卷轴----提升门客魅力书籍等级
        ["type"]=1,["quality"]=4,["sortId"]=124,["isUse"]=0,
    },
    ["1161"]={       ----卷轴残卷----合成卷轴礼包所需道具
        ["type"]=1,["quality"]=3,["sortId"]=125,["isUse"]=0,
    },
    ["1201"]={       ----属性丹----增加门客1000点随机属性
        ["type"]=1,["quality"]=3,["sortId"]=56,["howToGet"]=1,["isUse"]=1,["target"]=2,["getRewards"]="7_5_1000",
    },
    ["1202"]={       ----武力丹----增加门客1000点武力属性
        ["type"]=1,["quality"]=3,["sortId"]=57,["isUse"]=1,["target"]=2,["getRewards"]="7_1_1000",
    },
    ["1203"]={       ----智力丹----增加门客1000点智力属性
        ["type"]=1,["quality"]=3,["sortId"]=58,["isUse"]=1,["target"]=2,["getRewards"]="7_2_1000",
    },
    ["1204"]={       ----政治丹----增加门客1000点政治属性
        ["type"]=1,["quality"]=3,["sortId"]=59,["isUse"]=1,["target"]=2,["getRewards"]="7_3_1000",
    },
    ["1205"]={       ----魅力丹----增加门客1000点魅力属性
        ["type"]=1,["quality"]=3,["sortId"]=60,["isUse"]=1,["target"]=2,["getRewards"]="7_4_1000",
    },
    ["1206"]={       ----属性丸----增加门客500点随机属性
        ["type"]=1,["quality"]=2,["sortId"]=61,["isUse"]=1,["target"]=2,["getRewards"]="7_5_500",
    },
    ["1207"]={       ----武力丸----增加门客500点武力属性
        ["type"]=1,["quality"]=2,["sortId"]=62,["isUse"]=1,["target"]=2,["getRewards"]="7_1_500",
    },
    ["1208"]={       ----智力丸----增加门客500点智力属性
        ["type"]=1,["quality"]=2,["sortId"]=63,["isUse"]=1,["target"]=2,["getRewards"]="7_2_500",
    },
    ["1209"]={       ----政治丸----增加门客500点政治属性
        ["type"]=1,["quality"]=2,["sortId"]=64,["isUse"]=1,["target"]=2,["getRewards"]="7_3_500",
    },
    ["1210"]={       ----魅力丸----增加门客500点魅力属性
        ["type"]=1,["quality"]=2,["sortId"]=65,["isUse"]=1,["target"]=2,["getRewards"]="7_4_500",
    },
    ["1211"]={       ----属性散----增加门客100点随机属性
        ["type"]=1,["quality"]=1,["sortId"]=66,["isUse"]=1,["target"]=2,["getRewards"]="7_5_100",
    },
    ["1212"]={       ----武力散----增加门客100点武力属性
        ["type"]=1,["quality"]=1,["sortId"]=67,["isUse"]=1,["target"]=2,["getRewards"]="7_1_100",
    },
    ["1213"]={       ----智力散----增加门客100点智力属性
        ["type"]=1,["quality"]=1,["sortId"]=68,["isUse"]=1,["target"]=2,["getRewards"]="7_2_100",
    },
    ["1214"]={       ----政治散----增加门客100点政治属性
        ["type"]=1,["quality"]=1,["sortId"]=69,["isUse"]=1,["target"]=2,["getRewards"]="7_3_100",
    },
    ["1215"]={       ----魅力散----增加门客100点魅力属性
        ["type"]=1,["quality"]=1,["sortId"]=70,["isUse"]=1,["target"]=2,["getRewards"]="7_4_100",
    },
    ["1216"]={       ----属性果----增加门客5000点随机属性
        ["type"]=1,["quality"]=4,["sortId"]=51,["isUse"]=1,["target"]=2,["getRewards"]="7_5_5000",
    },
    ["1217"]={       ----武力果----增加门客5000点武力属性
        ["type"]=1,["quality"]=4,["sortId"]=52,["isUse"]=1,["target"]=2,["getRewards"]="7_1_5000",
    },
    ["1218"]={       ----智力果----增加门客5000点智力属性
        ["type"]=1,["quality"]=4,["sortId"]=53,["isUse"]=1,["target"]=2,["getRewards"]="7_2_5000",
    },
    ["1219"]={       ----政治果----增加门客5000点政治属性
        ["type"]=1,["quality"]=4,["sortId"]=54,["isUse"]=1,["target"]=2,["getRewards"]="7_3_5000",
    },
    ["1220"]={       ----魅力果----增加门客5000点魅力属性
        ["type"]=1,["quality"]=4,["sortId"]=55,["isUse"]=1,["target"]=2,["getRewards"]="7_4_5000",
    },
    ["1301"]={       ----精力丹----恢复当前全部精力
        ["type"]=1,["quality"]=3,["sortId"]=131,["isUse"]=0,
    },
    ["1302"]={       ----体力丹----恢复当前全部体力
        ["type"]=1,["quality"]=3,["sortId"]=132,["isUse"]=0,
    },
    ["1303"]={       ----活力丹----恢复当前子嗣全部活力
        ["type"]=1,["quality"]=3,["sortId"]=133,["isUse"]=0,
    },
    ["1351"]={       ----玛瑙心----赏赐后红颜亲密度+1
        ["type"]=1,["quality"]=2,["sortId"]=141,["isUse"]=0,
    },
    ["1352"]={       ----翡翠心----赏赐后红颜亲密度+2
        ["type"]=1,["quality"]=3,["sortId"]=142,["howToGet"]=1,["isUse"]=0,
    },
    ["1353"]={       ----木簪----赏赐后红颜魅力值+1
        ["type"]=1,["quality"]=2,["sortId"]=143,["isUse"]=0,
    },
    ["1354"]={       ----金簪----赏赐后红颜魅力值+2
        ["type"]=1,["quality"]=3,["sortId"]=144,["howToGet"]=1,["isUse"]=0,
    },
    ["1361"]={       ----亲密香囊----使用后随机红颜获得1~300点亲密度
        ["type"]=1,["quality"]=4,["sortId"]=145,["isUse"]=1,["target"]=3,["dropId"]={"14"},
    },
    ["1362"]={       ----魅力香囊----使用后随机红颜获得1~300点魅力值
        ["type"]=1,["quality"]=4,["sortId"]=146,["isUse"]=1,["target"]=3,["dropId"]={"15"},
    },
    ["1401"]={       ----连理枝----童生、秀才、举人子嗣联姻所需道具
        ["type"]=1,["quality"]=3,["sortId"]=181,["isUse"]=0,
    },
    ["1402"]={       ----比翼鸟----进士、探花子嗣联姻所需道具
        ["type"]=1,["quality"]=4,["sortId"]=182,["isUse"]=0,
    },
    ["1403"]={       ----鸳鸯玉----榜眼、状元子嗣联姻所需道具
        ["type"]=1,["quality"]=7,["sortId"]=183,["isUse"]=0,
    },
    ["1501"]={       ----家宴食材----举办家宴所需食材
        ["type"]=1,["quality"]=3,["sortId"]=191,["isUse"]=0,
    },
    ["1502"]={       ----家宴佐料----举办家宴所需佐料
        ["type"]=1,["quality"]=3,["sortId"]=192,["isUse"]=0,
    },
    ["1511"]={       ----官宴食材----举办官宴所需食材
        ["type"]=1,["quality"]=4,["sortId"]=193,["isUse"]=0,
    },
    ["1512"]={       ----官宴佐料----举办官宴所需佐料
        ["type"]=1,["quality"]=4,["sortId"]=194,["isUse"]=0,
    },
    ["1521"]={       ----宴会礼盒----可在赴宴时使用的道具
        ["type"]=1,["quality"]=7,["sortId"]=195,["isUse"]=0,
    },
    ["1522"]={       ----老鼠----可在赴宴时使用的道具
        ["type"]=1,["quality"]=7,["sortId"]=196,["isUse"]=0,
    },
    ["1523"]={       ----宴会请帖----在酒楼中使用后可增加赴宴次数
        ["type"]=1,["quality"]=3,["sortId"]=197,["howToGet"]=1,["isUse"]=0,
    },
    ["1551"]={       ----出使令----擂台每日正常出战4次后，额外获得出战次数
        ["type"]=1,["quality"]=2,["sortId"]=151,["isUse"]=0,
    },
    ["1552"]={       ----挑战书----擂台内挑战、复仇玩家所需道具
        ["type"]=1,["quality"]=3,["sortId"]=152,["isUse"]=0,
    },
    ["1553"]={       ----追杀令----擂台内追杀玩家所需道具
        ["type"]=1,["quality"]=4,["sortId"]=153,["isUse"]=0,
    },
    ["1554"]={       ----追杀令碎片----合成追杀令所需道具
        ["type"]=1,["quality"]=3,["sortId"]=154,["isUse"]=0,
    },
    ["1601"]={       ----金钟罩----
        ["type"]=1,["quality"]=7,["sortId"]=155,["isUse"]=0,
    },
    ["1701"]={       ----男爵服饰----男爵提拔所需道具，提升门客等级上限至150级
        ["type"]=1,["quality"]=2,["sortId"]=201,["howToGet"]=1,["isUse"]=0,
    },
    ["1702"]={       ----男爵发冠----男爵提拔所需道具，提升门客等级上限至150级
        ["type"]=1,["quality"]=2,["sortId"]=202,["howToGet"]=1,["isUse"]=0,
    },
    ["1703"]={       ----男爵衿带----男爵提拔所需道具，提升门客等级上限至150级
        ["type"]=1,["quality"]=2,["sortId"]=203,["howToGet"]=1,["isUse"]=0,
    },
    ["1704"]={       ----子爵服饰----子爵提拔所需道具，提升门客等级上限至200级
        ["type"]=1,["quality"]=3,["sortId"]=204,["isUse"]=0,
    },
    ["1705"]={       ----子爵发冠----子爵提拔所需道具，提升门客等级上限至200级
        ["type"]=1,["quality"]=3,["sortId"]=205,["isUse"]=0,
    },
    ["1706"]={       ----子爵衿带----子爵提拔所需道具，提升门客等级上限至200级
        ["type"]=1,["quality"]=3,["sortId"]=206,["isUse"]=0,
    },
    ["1707"]={       ----伯爵服饰----伯爵提拔所需道具，提升门客等级上限至250级
        ["type"]=1,["quality"]=4,["sortId"]=207,["isUse"]=0,
    },
    ["1708"]={       ----伯爵发冠----伯爵提拔所需道具，提升门客等级上限至250级
        ["type"]=1,["quality"]=4,["sortId"]=208,["isUse"]=0,
    },
    ["1709"]={       ----伯爵衿带----伯爵提拔所需道具，提升门客等级上限至250级
        ["type"]=1,["quality"]=4,["sortId"]=209,["isUse"]=0,
    },
    ["1710"]={       ----侯爵服饰----侯爵提拔所需道具，提升门客等级上限至300级
        ["type"]=1,["quality"]=5,["sortId"]=210,["isUse"]=0,
    },
    ["1711"]={       ----侯爵发冠----侯爵提拔所需道具，提升门客等级上限至300级
        ["type"]=1,["quality"]=5,["sortId"]=211,["isUse"]=0,
    },
    ["1712"]={       ----侯爵衿带----侯爵提拔所需道具，提升门客等级上限至300级
        ["type"]=1,["quality"]=5,["sortId"]=212,["isUse"]=0,
    },
    ["1713"]={       ----公爵服饰----公爵提拔所需道具，提升门客等级上限至350级
        ["type"]=1,["quality"]=6,["sortId"]=213,["isUse"]=0,
    },
    ["1714"]={       ----公爵发冠----公爵提拔所需道具，提升门客等级上限至350级
        ["type"]=1,["quality"]=6,["sortId"]=214,["isUse"]=0,
    },
    ["1715"]={       ----公爵衿带----公爵提拔所需道具，提升门客等级上限至350级
        ["type"]=1,["quality"]=6,["sortId"]=215,["isUse"]=0,
    },
    ["1716"]={       ----王爵服饰----王爵提拔所需道具，提升门客等级上限至400级
        ["type"]=1,["quality"]=7,["sortId"]=216,["isUse"]=0,
    },
    ["1717"]={       ----王爵发冠----王爵提拔所需道具，提升门客等级上限至400级
        ["type"]=1,["quality"]=7,["sortId"]=217,["isUse"]=0,
    },
    ["1718"]={       ----王爵衿带----王爵提拔所需道具，提升门客等级上限至400级
        ["type"]=1,["quality"]=7,["sortId"]=218,["isUse"]=0,
    },
    ["1751"]={       ----练武场令牌----创建练武场所需道具
        ["type"]=1,["quality"]=4,["sortId"]=171,["isUse"]=0,
    },
    ["1801"]={       ----动之以情----用于惩戒女囚活动，使用后有几率获得原谅绿帽
        ["type"]=1,["quality"]=2,["sortId"]=7000,["isUse"]=0,
    },
    ["1802"]={       ----晓之以理----用于惩戒女囚活动，使用后有几率获得原谅绿帽、白底碎花鞋
        ["type"]=1,["quality"]=3,["sortId"]=7000,["isUse"]=0,
    },
    ["1803"]={       ----道德批判----用于惩戒女囚活动，使用后有几率获得白底碎花鞋、霓裳羽衣
        ["type"]=1,["quality"]=4,["sortId"]=7000,["isUse"]=0,
    },
    ["1804"]={       ----舆论抨击----用于惩戒女囚活动，使用后有几率获得霓裳羽衣、鸳鸯锦缎
        ["type"]=1,["quality"]=7,["sortId"]=7000,["isUse"]=0,
    },
    ["1805"]={       ----纸灯----用于点灯祈福活动，使用后有几率获得原谅绿帽
        ["type"]=1,["quality"]=2,["sortId"]=7001,["isUse"]=0,
    },
    ["1806"]={       ----福灯----用于点灯祈福活动，使用后有几率获得原谅绿帽、白底碎花鞋
        ["type"]=1,["quality"]=3,["sortId"]=7002,["isUse"]=0,
    },
    ["1807"]={       ----宫廷灯----用于点灯祈福活动，使用后有几率获得白底碎花鞋、霓裳羽衣
        ["type"]=1,["quality"]=4,["sortId"]=7003,["isUse"]=0,
    },
    ["1808"]={       ----龙凤灯----用于点灯祈福活动，使用后有几率获得霓裳羽衣、鸳鸯锦缎
        ["type"]=1,["quality"]=7,["sortId"]=7004,["isUse"]=0,
    },
    ["1809"]={       ----狠辣皮鞭----用于惩戒女囚活动，使用后有几率获得原谅绿帽
        ["type"]=1,["quality"]=2,["sortId"]=7000,["isUse"]=0,
    },
    ["1810"]={       ----荆棘藤条----用于惩戒女囚活动，使用后有几率获得原谅绿帽、白底碎花鞋
        ["type"]=1,["quality"]=3,["sortId"]=7000,["isUse"]=0,
    },
    ["1811"]={       ----滚烫烙铁----用于惩戒女囚活动，使用后有几率获得白底碎花鞋、霓裳羽衣
        ["type"]=1,["quality"]=4,["sortId"]=7000,["isUse"]=0,
    },
    ["1812"]={       ----狼牙铁棒----用于惩戒女囚活动，使用后有几率获得霓裳羽衣、鸳鸯锦缎
        ["type"]=1,["quality"]=7,["sortId"]=7000,["isUse"]=0,
    },
    ["1813"]={       ----炮仗----用于驱赶年兽活动，使用后有几率获得压岁钱
        ["type"]=1,["quality"]=2,["sortId"]=7000,["isUse"]=0,
    },
    ["1814"]={       ----电光鞭炮----用于驱赶年兽活动，使用后有几率获得新衣服、压岁钱
        ["type"]=1,["quality"]=3,["sortId"]=7000,["isUse"]=0,
    },
    ["1815"]={       ----大地红----用于驱赶年兽活动，使用后有几率获得女儿红、新衣服
        ["type"]=1,["quality"]=4,["sortId"]=7000,["isUse"]=0,
    },
    ["1816"]={       ----震天雷----用于驱赶年兽活动，使用后有几率获得年夜饭、女儿红
        ["type"]=1,["quality"]=7,["sortId"]=7000,["isUse"]=0,
    },
    ["1817"]={       ----石子----用于营救红颜活动，使用后有几率获得道谢丝巾
        ["type"]=1,["quality"]=2,["sortId"]=7000,["isUse"]=0,
    },
    ["1818"]={       ----飞镖----用于营救红颜活动，使用后有几率获得感恩香囊、道谢丝巾
        ["type"]=1,["quality"]=3,["sortId"]=7000,["isUse"]=0,
    },
    ["1819"]={       ----飞刀----用于营救红颜活动，使用后有几率获得爱意发簪、感恩香囊
        ["type"]=1,["quality"]=4,["sortId"]=7000,["isUse"]=0,
    },
    ["1820"]={       ----弩箭----用于营救红颜活动，使用后有几率获得定情玉镯、爱意发簪
        ["type"]=1,["quality"]=7,["sortId"]=7000,["isUse"]=0,
    },
    ["1901"]={       ----改名卡----使用后可修改玩家昵称
        ["type"]=1,["quality"]=3,["sortId"]=8888,["howToGet"]=1,["isUse"]=1,
    },
    ["1902"]={       ----形象卡----使用后可以切换头像
        ["type"]=1,["quality"]=3,["sortId"]=8888,["howToGet"]=1,["isUse"]=1,
    },
    ["1910"]={       ----强盟令碎片----合成强盟令所需道具
        ["type"]=1,["quality"]=3,["sortId"]=161,["isUse"]=0,
    },
    ["1911"]={       ----强盟令----帮会道具建设所需道具
        ["type"]=1,["quality"]=4,["sortId"]=162,["isUse"]=0,
    },
    ["1912"]={       ----高级强盟令----帮会道具建设所需道具
        ["type"]=1,["quality"]=7,["sortId"]=163,["isUse"]=0,
    },
    ["1950"]={       ----蒙古可汗头颅----兑换、升级门客蛮王所需道具
        ["type"]=1,["quality"]=7,["sortId"]=221,["isUse"]=1,["getRewards"]="8_1051_1",
    },
    ["2000"]={       ----招募令碎片----用于合成招募令的碎片
        ["type"]=1,["quality"]=4,["sortId"]=3,["isUse"]=0,
    },
    ["2001"]={       ----谋士令----招募【四大谋士】所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=1,["isUse"]=0,
    },
    ["2002"]={       ----奸臣令----招募【四大奸臣】所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=2,["isUse"]=0,
    },
    ["2003"]={       ----巾帼令----招募【巾帼五虎】所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=3,["isUse"]=0,
    },
    ["2004"]={       ----五虎令----招募【五虎上将】所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=4,["isUse"]=0,
    },
    ["2101"]={       ----绸缎----兑换【红颜衣装】所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=3,["isUse"]=0,
    },
    ["2102"]={       ----信物----在【】活动中兑换红颜所需道具，活动中产出
        ["type"]=1,["quality"]=7,["sortId"]=4,["isUse"]=0,
    },
    ["2103"]={       ----杏花酒----在【春季庆典】活动中兑换奖励所需道具，活动结束后，道具会消失
        ["type"]=1,["quality"]=4,["sortId"]=1,["lastTime"]=172800,["isUse"]=1,["getRewards"]="2_1_10000",
    },
    ["2104"]={       ----竹叶青----在【春季庆典】活动中兑换奖励所需道具，活动结束后，道具会消失
        ["type"]=1,["quality"]=7,["sortId"]=1,["lastTime"]=172800,["isUse"]=1,["getRewards"]="2_1_20000",
    },
    ["2105"]={       ----风筝----在【鸢飞万里】活动中兑换奖励所需道具，活动结束后，道具会消失
        ["type"]=1,["quality"]=4,["sortId"]=1,["lastTime"]=172800,["isUse"]=1,["getRewards"]="2_1_10000",
    },
    ["2106"]={       ----纸鸢----在【鸢飞万里】活动中兑换奖励所需道具，活动结束后，道具会消失
        ["type"]=1,["quality"]=7,["sortId"]=1,["lastTime"]=172800,["isUse"]=1,["getRewards"]="2_1_20000",
    },
    ["2107"]={       ----青铜钥匙----在【铲除鳌拜】活动中用于开启青铜宝箱
        ["type"]=1,["quality"]=2,["sortId"]=161,["isUse"]=0,
    },
    ["2108"]={       ----白银钥匙----在【铲除鳌拜】活动中用于开启白银宝箱
        ["type"]=1,["quality"]=3,["sortId"]=162,["isUse"]=0,
    },
    ["2109"]={       ----黄金钥匙----在【铲除鳌拜】活动中用于开启黄金宝箱
        ["type"]=1,["quality"]=4,["sortId"]=163,["isUse"]=0,
    },
    ["2201"]={       ----伏兵锦囊----联盟盟战中使用，使用后可额外派遣一名门客作战
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["2202"]={       ----助威锦囊----联盟盟战中使用，使用后本轮派遣门客战斗力提升20%
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["2203"]={       ----鼓舞锦囊----联盟盟战中使用，使用后本轮派遣门客战斗力提升50%
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["2204"]={       ----嘲讽锦囊----联盟盟战中使用，使用后本轮对阵门客战斗力减少30%
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["2205"]={       ----死士锦囊----联盟盟战中使用，使用后出战门客战斗力提升300%，并在该回合在战斗后退场
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["2206"]={       ----连胜锦囊----联盟盟战中使用，使用后本轮连胜上限+5
        ["type"]=1,["quality"]=4,["sortId"]=500,["isUse"]=0,
    },
    ["5001"]={       ----家宴礼包----礼包内包含：家宴食材*5，家宴佐料*5，出战令*1，精力丹*1，体力丹*1，活力丹*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1501_5|6_1502_5|6_1090_1|6_1301_1|6_1302_1|6_1303_1",
    },
    ["5002"]={       ----新手礼包----礼包内包含：属性丹*1，属性丸*1，黑市银票*1，黑市兵符*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1201_1|6_1206_1|6_1005_1|6_1006_1",
    },
    ["5003"]={       ----潜力礼包----礼包内包含：卷轴礼包*1，销魂夹棍*1，属性丹*1，属性丸*1，银票*10，兵符*10，黑市银票*3，黑市兵符*3
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1803_1|6_1201_1|6_1206_1|6_1001_10|6_1003_10|6_1005_3|6_1006_3",
    },
    ["5004"]={       ----超级潜力礼包----礼包内包含：卷轴礼包*3，销魂夹棍*2，银票*50，兵符*50，武力丹*2，智力丹*2，政治丹*2，魅力丹*2
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_3|6_1803_2|6_1001_50|6_1003_50|6_1202_2|6_1203_2|6_1204_2|6_1205_2",
    },
    ["5005"]={       ----冲榜礼包----礼包内包含：银票*20，黑市银票*5，智力丸*1，智力丹*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1001_20|6_1005_5|6_1208_1|6_1203_1",
    },
    ["5006"]={       ----豪华礼包----礼包内包含：卷轴礼包*1，智力强化卷轴*1，银票*70，兵符*70，百宝袋*1，智力果*1，智力丹*1，智力丸*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1152_1|6_1001_70|6_1003_70|6_1010_1|6_1218_1|6_1203_1|6_1208_1",
    },
    ["5007"]={       ----升级礼包----礼包内包含：卷轴礼包*1，百宝袋*1，黑市银票*5，黑市兵符*5
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1010_1|6_1005_5|6_1006_5",
    },
    ["5008"]={       ----帮会礼包----礼包内包含：武力强化卷轴*1，智力强化卷轴*1，政治强化卷轴*1，魅力强化卷轴*1，属性果*1，属性丹*1，银票*50，兵符*50
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1151_1|6_1152_1|6_1153_1|6_1154_1|6_1216_1|6_1201_1|6_1001_50|6_1003_50",
    },
    ["5009"]={       ----冲榜礼包----礼包内包含：兵符*20，黑市兵符*5，魅力丹*1，魅力丸*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1003_20|6_1006_5|6_1205_1|6_1210_1",
    },
    ["5010"]={       ----魅力礼包----礼包内包含：卷轴礼包*1，魅力强化卷轴*1，银票*70，兵符*70，百宝袋*1，魅力果*1，魅力丹*1，魅力丸*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1154_1|6_1001_70|6_1003_70|6_1010_1|6_1220_1|6_1205_1|6_1210_1",
    },
    ["5011"]={       ----战力礼包----礼包内包含：卷轴礼包*1，滚烫烙铁*1,属性丹*1，银票*50，兵符*50
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1803_1|6_1201_1|6_1001_50|6_1003_50",
    },
    ["5012"]={       ----衙门冲榜礼包----礼包内包含：卷轴礼包*5，滚烫烙铁*2，挑战书*1，技能经验包*5，书籍经验包*5，属性果*1，属性果*1，属性果*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_5|6_1803_2|6_1552_1|6_1030_5|6_1020_5|6_1216_1|6_1216_1|6_1216_1",
    },
    ["5013"]={       ----提升礼包----礼包内包含：银票*50，征收令*1，政治丸*1，政治丹*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1001_50|6_1101_1|6_1209_1|6_1204_1",
    },
    ["5014"]={       ----晋升礼包----礼包内包含：卷轴礼包*1，政治强化卷轴*1，征收令*5，百宝袋*1，体力丹*1，政治果*1，政治丹*1，政治丸*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1153_1|6_1101_5|6_1010_1|6_1302_1|6_1219_1|6_1204_1|6_1209_1",
    },
    ["5015"]={       ----新手亲密礼包----礼包内包含：卷轴礼包*2，道德批判*1，翡翠心*10，金簪*10
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_2|6_1803_1|6_1352_10|6_1354_10",
    },
    ["5016"]={       ----亲密冲榜礼包----礼包内包含：卷轴礼包*4，舆论抨击*1，道德批判*1，百宝袋*1，翡翠心*40，玛瑙心*20，金簪*,40，木簪*20
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_4|6_1804_1|6_1803_1|6_1010_1|6_1352_40|6_1351_20|6_1354_40|6_1353_20",
    },
    ["5017"]={       ----小补给包----礼包内包含：卷轴礼包*1，银票*100，粮票*100，兵符*100
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1001_100|6_1002_100|6_1003_100",
    },
    ["5018"]={       ----大补给包----礼包内包含：武力强化卷轴*1，智力强化卷轴*1，政治强化卷轴*1，魅力强化卷轴*1，武力果*1，智力果*1，政治果*1，魅力果*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1151_1|6_1152_1|6_1153_1|6_1154_1|6_1217_1|6_1218_1|6_1219_1|6_1220_1",
    },
    ["5019"]={       ----增强版4--1----礼包内包含：卷轴礼包*2，挑战书*1，道德批判*1，晓之以理*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_2|6_1552_1|6_1803_1|6_1802_1",
    },
    ["5020"]={       ----增强版4--2----礼包内包含：卷轴礼包*5，舆论抨击*1，道德批判*1，挑战书*2，技能经验包*5，属性果*5，属性丹*5，属性丸*5
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_5|6_1804_1|6_1803_1|6_1552_2|6_1030_5|6_1216_5|6_1201_5|6_1206_5",
    },
    ["5021"]={       ----增强版4--3----礼包内包含：卷轴礼包*1，魅力强化卷轴*1，黑市兵符*10，兵符*70，百宝袋*1，魅力果*1，魅力丹*1，魅力丸*1
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_1|6_1154_1|6_1006_10|6_1003_70|6_1010_1|6_1220_1|6_1205_1|6_1210_1",
    },
    ["5022"]={       ----增强版3--1----礼包内包含：卷轴礼包*4，书籍经验包*4，百宝袋*1，出战令*1，属性果*3，属性丹*5，银票*60，兵符*60
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_4|6_1020_4|6_1010_1|6_1090_1|6_1216_3|6_1201_5|6_1001_60|6_1003_60",
    },
    ["5023"]={       ----增强版2--1----礼包内包含：卷轴礼包*4，舆论抨击*1，道德批判*1，体力丹*5，翡翠心*40，玛瑙心*20，金簪*40，木簪*20
        ["type"]=1,["quality"]=7,["sortId"]=9999,["isUse"]=1,["target"]=1,["getRewards"]="6_1150_4|6_1804_1|6_1803_1|6_1302_5|6_1352_40|6_1354_40|6_1351_20|6_1353_20",
    },
}
return itemCfg
