--练武场（翰林院）配置
local studyAtkCfg={
      --ability  书籍（资质）的ID  引用abilityCfg
      --needExp  升级所需的经验
      --upLv  书籍提升 X 级
    ["1"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=3683,
        ["upLv"]=1,
    },
    ["2"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=6629,
        ["upLv"]=1,
    },
    ["3"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=15468,
        ["upLv"]=1,
    },
    ["4"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=29462,
        ["upLv"]=1,
    },
    ["5"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=44194,
        ["upLv"]=1,
    },
    ["6"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=58925,
        ["upLv"]=1,
    },
    ["7"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=73656,
        ["upLv"]=1,
    },
    ["8"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=114167,
        ["upLv"]=1,
    },
    ["9"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=154678,
        ["upLv"]=1,
    },
    ["10"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=235699,
        ["upLv"]=1,
    },
    ["11"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=7366,
        ["upLv"]=1,
    },
    ["12"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=13258,
        ["upLv"]=1,
    },
    ["13"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=30936,
        ["upLv"]=1,
    },
    ["14"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=58924,
        ["upLv"]=1,
    },
    ["15"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=88388,
        ["upLv"]=1,
    },
    ["16"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=117850,
        ["upLv"]=1,
    },
    ["17"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=147312,
        ["upLv"]=1,
    },
    ["18"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=228334,
        ["upLv"]=1,
    },
    ["19"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=309356,
        ["upLv"]=1,
    },
    ["20"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=471398,
        ["upLv"]=1,
    },
    ["21"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=14732,
        ["upLv"]=1,
    },
    ["22"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=26516,
        ["upLv"]=1,
    },
    ["23"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=61872,
        ["upLv"]=1,
    },
    ["24"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=117848,
        ["upLv"]=1,
    },
    ["25"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=176776,
        ["upLv"]=1,
    },
    ["26"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=235700,
        ["upLv"]=1,
    },
    ["27"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=294624,
        ["upLv"]=1,
    },
    ["28"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=456668,
        ["upLv"]=1,
    },
    ["29"]={       ----六字诀----
        ["ability"]="301",
        ["needExp"]=618712,
        ["upLv"]=1,
    },
    ["30"]={       ----庄子----
        ["ability"]="321",
        ["needExp"]=942796,
        ["upLv"]=1,
    },
    ["31"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=29464,
        ["upLv"]=1,
    },
    ["32"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=53032,
        ["upLv"]=1,
    },
    ["33"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=123744,
        ["upLv"]=1,
    },
    ["34"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=235696,
        ["upLv"]=1,
    },
    ["35"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=353552,
        ["upLv"]=1,
    },
    ["36"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=471400,
        ["upLv"]=1,
    },
    ["37"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=589248,
        ["upLv"]=1,
    },
    ["38"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=913336,
        ["upLv"]=1,
    },
    ["39"]={       ----公羊传----
        ["ability"]="341",
        ["needExp"]=1237424,
        ["upLv"]=1,
    },
    ["40"]={       ----中庸----
        ["ability"]="361",
        ["needExp"]=1885592,
        ["upLv"]=1,
    },
    ["41"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=58928,
        ["upLv"]=1,
    },
    ["42"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=106064,
        ["upLv"]=1,
    },
    ["43"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=247488,
        ["upLv"]=1,
    },
    ["44"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=471392,
        ["upLv"]=1,
    },
    ["45"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=707104,
        ["upLv"]=1,
    },
    ["46"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=942800,
        ["upLv"]=1,
    },
    ["47"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=1178496,
        ["upLv"]=1,
    },
    ["48"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=1826672,
        ["upLv"]=1,
    },
    ["49"]={       ----八段锦----
        ["ability"]="405",
        ["needExp"]=2474848,
        ["upLv"]=1,
    },
    ["50"]={       ----孟子----
        ["ability"]="429",
        ["needExp"]=3771184,
        ["upLv"]=1,
    },
    ["51"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=117856,
        ["upLv"]=1,
    },
    ["52"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=212128,
        ["upLv"]=1,
    },
    ["53"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=494976,
        ["upLv"]=1,
    },
    ["54"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=942784,
        ["upLv"]=1,
    },
    ["55"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=1414208,
        ["upLv"]=1,
    },
    ["56"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=1885600,
        ["upLv"]=1,
    },
    ["57"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=2356992,
        ["upLv"]=1,
    },
    ["58"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=3653344,
        ["upLv"]=1,
    },
    ["59"]={       ----左传----
        ["ability"]="453",
        ["needExp"]=4949696,
        ["upLv"]=1,
    },
    ["60"]={       ----礼记----
        ["ability"]="468",
        ["needExp"]=7542368,
        ["upLv"]=1,
    },
    ["61"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=235712,
        ["upLv"]=1,
    },
    ["62"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=424256,
        ["upLv"]=1,
    },
    ["63"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=989952,
        ["upLv"]=1,
    },
    ["64"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=1885568,
        ["upLv"]=1,
    },
    ["65"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=2828416,
        ["upLv"]=1,
    },
    ["66"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=3771200,
        ["upLv"]=1,
    },
    ["67"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=4713984,
        ["upLv"]=1,
    },
    ["68"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=7306688,
        ["upLv"]=1,
    },
    ["69"]={       ----六字诀----
        ["ability"]="301",
        ["needExp"]=9899392,
        ["upLv"]=1,
    },
    ["70"]={       ----庄子----
        ["ability"]="321",
        ["needExp"]=15084736,
        ["upLv"]=1,
    },
    ["71"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=471424,
        ["upLv"]=1,
    },
    ["72"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=848512,
        ["upLv"]=1,
    },
    ["73"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=1979904,
        ["upLv"]=1,
    },
    ["74"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=3771136,
        ["upLv"]=1,
    },
    ["75"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=5656832,
        ["upLv"]=1,
    },
    ["76"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=7542400,
        ["upLv"]=1,
    },
    ["77"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=9427968,
        ["upLv"]=1,
    },
    ["78"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=14613376,
        ["upLv"]=1,
    },
    ["79"]={       ----公羊传----
        ["ability"]="341",
        ["needExp"]=19798784,
        ["upLv"]=1,
    },
    ["80"]={       ----中庸----
        ["ability"]="361",
        ["needExp"]=30169472,
        ["upLv"]=1,
    },
    ["81"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=942848,
        ["upLv"]=1,
    },
    ["82"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=1697024,
        ["upLv"]=1,
    },
    ["83"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=3959808,
        ["upLv"]=1,
    },
    ["84"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=7542272,
        ["upLv"]=1,
    },
    ["85"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=11313664,
        ["upLv"]=1,
    },
    ["86"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=15084800,
        ["upLv"]=1,
    },
    ["87"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=18855936,
        ["upLv"]=1,
    },
    ["88"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=29226752,
        ["upLv"]=1,
    },
    ["89"]={       ----八段锦----
        ["ability"]="405",
        ["needExp"]=39597568,
        ["upLv"]=1,
    },
    ["90"]={       ----孟子----
        ["ability"]="429",
        ["needExp"]=60338944,
        ["upLv"]=1,
    },
    ["91"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=1885696,
        ["upLv"]=1,
    },
    ["92"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=3394048,
        ["upLv"]=1,
    },
    ["93"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=7919616,
        ["upLv"]=1,
    },
    ["94"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=15084544,
        ["upLv"]=1,
    },
    ["95"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=22627328,
        ["upLv"]=1,
    },
    ["96"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=30169600,
        ["upLv"]=1,
    },
    ["97"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=37711872,
        ["upLv"]=1,
    },
    ["98"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=58453504,
        ["upLv"]=1,
    },
    ["99"]={       ----左传----
        ["ability"]="453",
        ["needExp"]=79195136,
        ["upLv"]=1,
    },
    ["100"]={       ----礼记----
        ["ability"]="468",
        ["needExp"]=120677888,
        ["upLv"]=1,
    },
}
return studyAtkCfg
