--练武场（翰林院）配置
local studyAtkCfg={
      --ability  书籍（资质）的ID  引用abilityCfg
      --needExp  升级所需的经验
      --upLv  书籍提升 X 级
    ["1"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=3683,
        ["upLv"]=1,
    },
    ["2"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=5525,
        ["upLv"]=1,
    },
    ["3"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=15468,
        ["upLv"]=1,
    },
    ["4"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=23202,
        ["upLv"]=1,
    },
    ["5"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=34803,
        ["upLv"]=1,
    },
    ["6"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=40824,
        ["upLv"]=1,
    },
    ["7"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=61236,
        ["upLv"]=1,
    },
    ["8"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=72576,
        ["upLv"]=1,
    },
    ["9"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=154678,
        ["upLv"]=1,
    },
    ["10"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=232017,
        ["upLv"]=1,
    },
    ["11"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=7366,
        ["upLv"]=1,
    },
    ["12"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=11050,
        ["upLv"]=1,
    },
    ["13"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=30936,
        ["upLv"]=1,
    },
    ["14"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=46404,
        ["upLv"]=1,
    },
    ["15"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=69606,
        ["upLv"]=1,
    },
    ["16"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=81648,
        ["upLv"]=1,
    },
    ["17"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=122472,
        ["upLv"]=1,
    },
    ["18"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=145152,
        ["upLv"]=1,
    },
    ["19"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=309356,
        ["upLv"]=1,
    },
    ["20"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=464034,
        ["upLv"]=1,
    },
    ["21"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=14732,
        ["upLv"]=1,
    },
    ["22"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=22100,
        ["upLv"]=1,
    },
    ["23"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=61872,
        ["upLv"]=1,
    },
    ["24"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=92808,
        ["upLv"]=1,
    },
    ["25"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=139212,
        ["upLv"]=1,
    },
    ["26"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=163296,
        ["upLv"]=1,
    },
    ["27"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=244944,
        ["upLv"]=1,
    },
    ["28"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=290304,
        ["upLv"]=1,
    },
    ["29"]={       ----六字诀----
        ["ability"]="301",
        ["needExp"]=618712,
        ["upLv"]=1,
    },
    ["30"]={       ----庄子----
        ["ability"]="321",
        ["needExp"]=928068,
        ["upLv"]=1,
    },
    ["31"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=29464,
        ["upLv"]=1,
    },
    ["32"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=44200,
        ["upLv"]=1,
    },
    ["33"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=123744,
        ["upLv"]=1,
    },
    ["34"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=185616,
        ["upLv"]=1,
    },
    ["35"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=278424,
        ["upLv"]=1,
    },
    ["36"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=326592,
        ["upLv"]=1,
    },
    ["37"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=489888,
        ["upLv"]=1,
    },
    ["38"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=580608,
        ["upLv"]=1,
    },
    ["39"]={       ----公羊传----
        ["ability"]="341",
        ["needExp"]=1237424,
        ["upLv"]=1,
    },
    ["40"]={       ----中庸----
        ["ability"]="361",
        ["needExp"]=1856136,
        ["upLv"]=1,
    },
    ["41"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=58928,
        ["upLv"]=1,
    },
    ["42"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=88400,
        ["upLv"]=1,
    },
    ["43"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=247488,
        ["upLv"]=1,
    },
    ["44"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=371232,
        ["upLv"]=1,
    },
    ["45"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=556848,
        ["upLv"]=1,
    },
    ["46"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=653184,
        ["upLv"]=1,
    },
    ["47"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=979776,
        ["upLv"]=1,
    },
    ["48"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=1161216,
        ["upLv"]=1,
    },
    ["49"]={       ----八段锦----
        ["ability"]="405",
        ["needExp"]=2474848,
        ["upLv"]=1,
    },
    ["50"]={       ----孟子----
        ["ability"]="429",
        ["needExp"]=3712272,
        ["upLv"]=1,
    },
    ["51"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=117856,
        ["upLv"]=1,
    },
    ["52"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=176800,
        ["upLv"]=1,
    },
    ["53"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=494976,
        ["upLv"]=1,
    },
    ["54"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=742464,
        ["upLv"]=1,
    },
    ["55"]={       ----强身术----
        ["ability"]="101",
        ["needExp"]=1113696,
        ["upLv"]=1,
    },
    ["56"]={       ----尔雅----
        ["ability"]="121",
        ["needExp"]=1306368,
        ["upLv"]=1,
    },
    ["57"]={       ----大学----
        ["ability"]="141",
        ["needExp"]=1959552,
        ["upLv"]=1,
    },
    ["58"]={       ----仪礼----
        ["ability"]="161",
        ["needExp"]=2322432,
        ["upLv"]=1,
    },
    ["59"]={       ----左传----
        ["ability"]="453",
        ["needExp"]=4949696,
        ["upLv"]=1,
    },
    ["60"]={       ----礼记----
        ["ability"]="468",
        ["needExp"]=7424544,
        ["upLv"]=1,
    },
    ["61"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=235712,
        ["upLv"]=1,
    },
    ["62"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=353600,
        ["upLv"]=1,
    },
    ["63"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=989952,
        ["upLv"]=1,
    },
    ["64"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=1484928,
        ["upLv"]=1,
    },
    ["65"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=2227392,
        ["upLv"]=1,
    },
    ["66"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=2612736,
        ["upLv"]=1,
    },
    ["67"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=3919104,
        ["upLv"]=1,
    },
    ["68"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=4644864,
        ["upLv"]=1,
    },
    ["69"]={       ----六字诀----
        ["ability"]="301",
        ["needExp"]=9899392,
        ["upLv"]=1,
    },
    ["70"]={       ----庄子----
        ["ability"]="321",
        ["needExp"]=14849088,
        ["upLv"]=1,
    },
    ["71"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=471424,
        ["upLv"]=1,
    },
    ["72"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=707200,
        ["upLv"]=1,
    },
    ["73"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=1979904,
        ["upLv"]=1,
    },
    ["74"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=2969856,
        ["upLv"]=1,
    },
    ["75"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=4454784,
        ["upLv"]=1,
    },
    ["76"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=5225472,
        ["upLv"]=1,
    },
    ["77"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=7838208,
        ["upLv"]=1,
    },
    ["78"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=9289728,
        ["upLv"]=1,
    },
    ["79"]={       ----公羊传----
        ["ability"]="341",
        ["needExp"]=19798784,
        ["upLv"]=1,
    },
    ["80"]={       ----中庸----
        ["ability"]="361",
        ["needExp"]=29698176,
        ["upLv"]=1,
    },
    ["81"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=942848,
        ["upLv"]=1,
    },
    ["82"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=1414400,
        ["upLv"]=1,
    },
    ["83"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=3959808,
        ["upLv"]=1,
    },
    ["84"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=5939712,
        ["upLv"]=1,
    },
    ["85"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=8909568,
        ["upLv"]=1,
    },
    ["86"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=10450944,
        ["upLv"]=1,
    },
    ["87"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=15676416,
        ["upLv"]=1,
    },
    ["88"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=18579456,
        ["upLv"]=1,
    },
    ["89"]={       ----八段锦----
        ["ability"]="405",
        ["needExp"]=39597568,
        ["upLv"]=1,
    },
    ["90"]={       ----孟子----
        ["ability"]="429",
        ["needExp"]=59396352,
        ["upLv"]=1,
    },
    ["91"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=1885696,
        ["upLv"]=1,
    },
    ["92"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=2828800,
        ["upLv"]=1,
    },
    ["93"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=7919616,
        ["upLv"]=1,
    },
    ["94"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=11879424,
        ["upLv"]=1,
    },
    ["95"]={       ----吐纳法----
        ["ability"]="201",
        ["needExp"]=17819136,
        ["upLv"]=1,
    },
    ["96"]={       ----易经----
        ["ability"]="221",
        ["needExp"]=20901888,
        ["upLv"]=1,
    },
    ["97"]={       ----书经----
        ["ability"]="241",
        ["needExp"]=31352832,
        ["upLv"]=1,
    },
    ["98"]={       ----周礼----
        ["ability"]="261",
        ["needExp"]=37158912,
        ["upLv"]=1,
    },
    ["99"]={       ----左传----
        ["ability"]="453",
        ["needExp"]=79195136,
        ["upLv"]=1,
    },
    ["100"]={       ----礼记----
        ["ability"]="468",
        ["needExp"]=118792704,
        ["upLv"]=1,
    },
}
return studyAtkCfg
