namespace PlatformCfg 
{
	/**
	 * 绑定手机
	 */
	export let bindPhone={
		// "17001001":"1",
		// "17001051":"1",
		// "17001114":"1",
		// "17001139":"1"
	}

	export let weichatPub={

	}

	export let useSDK={
		"17001000":"0",
		"17001001":"1",
		"17001002":"1",
		"devsdk":"1"
	};

	export let closeSwitchAcount={
		"fkylc":"1",
		"wanba":"1",
		"jj":"1"
	}

	export let platNameCfg={
		"17001000":"3k",
		"17004000":"tw"
	}

	export let contactCfg={
		// "17001001":"客服电话:4009933348",
		"17001002":["客服QQ:3004776131","客服电话:400-993-3348"],
		"17001003-17001137":["客服QQ:3557595700"],
		"17005000":["官方QQ群：497564630"],//应用宝
		"17007001":["官方QQ群：641188812"],//疯狂游乐场
		"17003000":["官方QQ群：496098831"],//玩吧
		"17009000":["客服QQ:2198936198"],//享乐源
		"17009004-17009005":["客服QQ群: 724420901"],//支付宝即拓渠道
	}

	export let statementCfg={
		"17007000":`审批文号：新广出审【2014】1247号  出版物号：ISBN-978-7-89988-124-8\n著作权人：天津齐天兄弟科技有限公司  出版服务单位：天津齐天兄弟科技有限公司\n备案文号：文网游备字〔2018〕Ｍ-RPG 0604 号  适龄提示：16岁以上`,
		"17003000":`审批文号：新广出审【2014】1247号  出版物号：ISBN-978-7-89988-124-8\n著作权人：杭州汉唐文化传播有限公司  出版服务单位：杭州汉唐文化传播有限公司\n公司备案号：津网文〔2016〕6371-082号 备案文号：文网游备字〔2017〕Ｍ-RPG 1638 号`,
		"17023000":`审批文号：新广出审【2014】1247号  出版物号：ISBN-978-7-89988-124-8\n著作权人：杭州汉唐文化传播有限公司  出版服务单位：杭州汉唐文化传播有限公司\n备案文号：文网游备字〔2017〕Ｍ-RPG 1568 号  适龄提示：16岁以上`,
		"17018011":`审批文号：新广出审【2014】1247号  出版物号：ISBN-978-7-89988-124-8\n著作权人：天津齐天兄弟科技有限公司  出版服务单位：天津齐天兄弟科技有限公司\n备案文号：文网游备字〔2018〕Ｍ-RPG 0604 号  适龄提示：16岁以上`,
	};
}