--港台票选美女玩家活动配置
local draftCfg={
    [1]={  --配置一：港台票选美女玩家活动
        --活动期间充值元宝与获得鲜花比例（玩家每充值10元宝获得1鲜花）
        ratio1=10,
        
        --活动期间玩家获得活跃度与获得鲜花比例（玩家每获得10点活跃度可获赠1鲜花）
        ratio2=10,
        
        --活动期间玩家上榜所需消耗鲜花数量（消耗鲜花低于此数量的玩家将不会上榜）
        rankNeed=100,
        
        --献花所需最低官职
        needLv=6,
        
        --玩家消耗鲜花数量奖励（活动期间不重置）
          --needNum：消耗鲜花数量
          --getReward：奖励
        flowerReward={
            [1]={
                ["needNum"]=10,["getReward"]="6_1353_1|6_1351_1",
            },
            [2]={
                ["needNum"]=40,["getReward"]="6_1354_1|6_1352_1",
            },
            [3]={
                ["needNum"]=70,["getReward"]="6_1362_1|6_1206_1",
            },
            [4]={
                ["needNum"]=100,["getReward"]="6_1361_1|6_1010_1",
            },
            [5]={
                ["needNum"]=150,["getReward"]="6_1150_1|6_1402_1",
            },
        },
        
        --消耗鲜花数量全区排名奖励
          --rank：排行榜上下限  例：{5,10} 第五名至第十名
          --getReward：奖励
        crossServerRankList={
            [1]={
                ["rank"]={1,1},["getReward"]="6_2110_1|11_4008_1|6_1150_8|6_1216_8|6_1701_5|6_1702_5|6_1703_5|6_1501_5|6_1502_5",
            },
            [2]={
                ["rank"]={2,2},["getReward"]="6_2110_1|11_4008_1|6_1150_7|6_1216_7|6_1701_4|6_1702_4|6_1703_4|6_1501_4|6_1502_4",
            },
            [3]={
                ["rank"]={3,3},["getReward"]="6_2110_1|11_4008_1|6_1150_6|6_1216_6|6_1701_3|6_1702_3|6_1703_3|6_1501_3|6_1502_3",
            },
            [2]={
                ["rank"]={4,10},["getReward"]="6_2110_1|11_4008_1|6_1150_5|6_1216_5|6_1701_2|6_1702_2|6_1703_2|6_1501_2|6_1502_2",
            },
            [3]={
                ["rank"]={11,50},["getReward"]="6_2110_1|11_4008_1|6_1150_3|6_1216_3|6_1701_1|6_1702_1|6_1703_1|6_1501_1|6_1502_1",
            },
            [4]={
                ["rank"]={51,100},["getReward"]="11_4008_1|6_1150_2|6_1216_2|6_1004_3",
            },
            [5]={
                ["rank"]={101,200},["getReward"]="11_4008_1|6_1150_1|6_1216_1|6_1004_1",
            },
        },
        
        --美女玩家信息
          --server：区服
          --name：名称
        female={
            [1]={
                ["server"]=1,["name"]="沉鱼",
            },
            [2]={
                ["server"]=2,["name"]="落雁",
            },
            [3]={
                ["server"]=3,["name"]="闭月",
            },
            [4]={
                ["server"]=4,["name"]="羞花",
            },
            [5]={
                ["server"]=5,["name"]="环肥",
            },
            [6]={
                ["server"]=6,["name"]="燕瘦",
            },
        },
        
    },
}
return draftCfg
